# Experiment 4: Data Import and Export with Dataset Exploration

This experiment covers importing data with Pandas, exploring dataset properties, and calculating various summary statistics.

In [12]:
import pandas as pd
import numpy as np

In [2]:
# Load the dataset
df= pd.read_csv('Titanic.csv')

## Step 1: Dataset Overview

### ***Number of Rows and Columns***

In [3]:
print(f'Number of rows: {df.shape[0]}')
print(f'Number of columns: {df.shape[1]}')

Number of rows: 1786
Number of columns: 1

### ***First 5 Rows of the Dataset***

In [4]:
df.head()

                                                                                                                                      <<<<<<< HEAD
﻿PassengerId Survived Pclass Name                                               Sex    Age SibSp Parch Ticket           Fare    Cabin     Embarked
1            0        3      Braund, Mr. Owen Harris                            male   22  1     0     A/5 21171        7.25    NaN              S
2            1        1      Cumings, Mrs. John Bradley (Florence Briggs Tha... female 38  1     0     PC 17599         71.2833 C85              C
3            1        3      Heikkinen, Miss. Laina                             female 26  0     0     STON/O2. 3101282 7.925   NaN              S
4            1        1      Futrelle, Mrs. Jacques Heath (Lily May Peel)       female 35  1     0     113803           53.1    C123             S

### ***Dataset Size***

In [5]:
print(f'Size of dataset : {df.size}')

Size of dataset : 1786

## **Step 2: Checking for Missing Values**

In [6]:
df.isnull().sum()

<<<<<<< HEAD    6
dtype: int64

## Step 3: Descriptive Statistics for Numerical Columns

### ***Sum of Numerical Columns***

In [8]:
df.sum(numeric_only=True)

Series([], dtype: float64)

### ***Average of Numerical Columns***

In [9]:
df.mean(numeric_only=True)

Series([], dtype: float64)

### ***Minimum Values in Numerical Columns***

In [10]:
df.min(numeric_only=True)

Series([], dtype: float64)

### ***Maximum Values in Numerical Columns***

In [11]:
df.max(numeric_only=True)

Series([], dtype: float64)